---
kind: other
id: Properties.T:Autodesk.Revit.DB.FaceSilhouetteNode
source: html/d9b8b98a-b9bf-0bb1-8fbf-ab461bcf83db.htm
---
# FaceSilhouetteNode Properties

Specifies whether the .NET object represents a valid Revit entity.